{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_5", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 78], "dtype": "float32", "sparse": false, "name": "input_layer_4"}, "name": "input_layer_4", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_shape": [null, 78], "dtype": "float32", "sparse": false, "name": "input_layer_5"}, "name": "input_layer_5", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "dtype": "float32", "input_dim": 28508, "output_dim": 100, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "embedding_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 78], "dtype": "float32", "keras_history": ["input_layer_4", 0, 0]}}], "kwargs": {}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 78], "dtype": "float32", "keras_history": ["input_layer_5", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "OrthogonalInitializer", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "name": "lstm_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 78, 100], "dtype": "float32", "keras_history": ["embedding_2", 0, 0]}}], "kwargs": {"training": false, "mask": null}}, {"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 78, 100], "dtype": "float32", "keras_history": ["embedding_2", 1, 0]}}], "kwargs": {"training": false, "mask": null}}]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": {"module": "builtins", "class_name": "function", "config": "cosine_similarity", "registered_name": "function"}, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["lstm_2", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["lstm_2", 1, 0]}}]], "kwargs": {"mask": [null, null]}}]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": {"class_name": "__lambda__", "config": {"code": "4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAHMIAAAAfABkARQAUwApAk7pZAAAAKkAKQHaAXhyAgAA\nAHICAAAA+h88aXB5dGhvbi1pbnB1dC01My0zMzg2ZDcwZmQyMjg+2gg8bGFtYmRhPgoAAABzAgAA\nAAgA\n", "defaults": null, "closure": null}}, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["lambda_3", 0, 0]}}], "kwargs": {"mask": null}}]}], "input_layers": [["input_layer_4", 0, 0], ["input_layer_5", 0, 0]], "output_layers": [["lambda_4", 0, 0]]}}, "training_config": {"loss": "mse", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "embedding_2/embeddings", "shape": [28508, 100], "dtype": "float32"}, {"name": "lstm_2/lstm_cell/kernel", "shape": [100, 256], "dtype": "float32"}, {"name": "lstm_2/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm_2/lstm_cell/bias", "shape": [256], "dtype": "float32"}]}]}